vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7019.inc
T_COMTX                        EQU       COMTX     -UARTBASE  
T_COMRX                        EQU       COMRX     -UARTBASE  
T_COMDIV0                      EQU       COMDIV0   -UARTBASE  
T_COMIEN0                      EQU       COMIEN0   -UARTBASE  
T_COMDIV1                      EQU       COMDIV1   -UARTBASE  
T_COMIID0                      EQU       COMIID0   -UARTBASE  
T_COMCON0                      EQU       COMCON0   -UARTBASE  
T_COMCON1                      EQU       COMCON1   -UARTBASE  
T_COMSTA0                      EQU       COMSTA0   -UARTBASE  
T_COMSTA1                      EQU       COMSTA1   -UARTBASE  
T_COMSCR                       EQU       COMSCR    -UARTBASE  
T_COMIEN1                      EQU       COMIEN1   -UARTBASE  
T_COMIID1                      EQU       COMIID1   -UARTBASE  
T_COMADR                       EQU       COMADR    -UARTBASE  
T_COMDIV2                      EQU       COMDIV2   -UARTBASE  

COMTX_OFFSET                   EQU       0x0700
COMRX_OFFSET                   EQU       0x0700
COMDIV0_OFFSET                 EQU       0x0700
COMIEN0_OFFSET                 EQU       0x0704
COMDIV1_OFFSET                 EQU       0x0704
COMIID0_OFFSET                 EQU       0x0708
COMCON0_OFFSET                 EQU       0x070C
COMCON1_OFFSET                 EQU       0x0710
COMSTA0_OFFSET                 EQU       0x0714
COMSTA1_OFFSET                 EQU       0x0718
COMSCR_OFFSET                  EQU       0x071C
COMIEN1_OFFSET                 EQU       0x0720
COMIID1_OFFSET                 EQU       0x0724
COMADR_OFFSET                  EQU       0x0728
COMDIV2_OFFSET                 EQU       0x072C

; I2C BUS PERIPHERAL DEVICE

I2CBASE                        EQU       0xFFFF0800
I2CMSTA                        EQU       0xFFFF0800
I2CSSTA                        EQU       0xFFFF0804
I2CSRX                         EQU       0xFFFF0808
I2CSTX                         EQU       0xFFFF080C
I2CMRX                         EQU       0xFFFF0810
I2CMTX                         EQU       0xFFFF0814
I2CCNT                         EQU       0xFFFF0818
I2CADR                         EQU       0xFFFF081C
I2CBYTE                        EQU       0xFFFF0824
I2CALT                         EQU       0xFFFF0828
I2CCFG                         EQU       0xFFFF082C
I2CDIV                         EQU       0xFFFF0830
I2CID0                         EQU       0xFFFF0838
I2CID1                         EQU       0xFFFF083C
I2CID2                         EQU       0xFFFF0840
I2CID3                         EQU       0xFFFF0844
I2CCCNT                        EQU       0xFFFF0848
I2CFSTA                        EQU       0xFFFF084C
Z_I2CMSTA                      EQU       I2CMSTA   -Z_BASE
Z_I2CSSTA                      EQU       I2CSSTA   -Z_BASE
Z_I2CSRX                       EQU       I2CSRX    -Z_BASE
Z_I2CSTX                       EQU       I2CSTX    -Z_BASE
Z_I2CMRX                       EQU       I2CMRX    -Z_BASE
Z_I2CMTX                       EQU       I2CMTX    -Z_BASE
Z_I2CCNT                       EQU       I2CCNT    -Z_BASE
Z_I2CADR                       EQU       I2CADR    -Z_BASE
Z_I2CBYTE                      EQU       I2CBYTE   -Z_BASE
Z_I2CALT                       EQU       I2CALT    -Z_BASE
Z_I2CCFG                       EQU       I2CCFG    -Z_BASE
Z_I2CDIV                       EQU       I2CDIV    -Z_BASE
Z_I2CID0                       EQU       I2CID0    -Z_BASE
Z_I2CID1                       EQU       I2CID1    -Z_BASE
Z_I2CID2                       EQU       I2CID2    -Z_BASE
Z_I2CID3                       EQU       I2CID3    -Z_BASE
Z_I2CCCNT                      EQU       I2CCCNT   -Z_BASE
Z_I2CFSTA                      EQU       I2CFSTA   -Z_BASE

T_I2CMSTA                      EQU       I2CMSTA   -I2CBASE   
T_I2CSSTA                      EQU       I2CSSTA   -I2CBASE   
T_I2CSRX                       EQU       I2CSRX    -I2CBASE   
T_I2CSTX                       EQU       I2CSTX    -I2CBASE   
T_I2CMRX                       EQU       I2CMRX    -I2CBASE   
T_I2CMTX                       EQU       I2CMTX    -I2CBASE   
T_I2CCNT                       EQU       I2CCNT    -I2CBASE   
T_I2CADR                       EQU       I2CADR    -I2CBASE   
T_I2CBYTE                      EQU       I2CBYTE   -I2CBASE   
T_I2CALT                       EQU       I2CALT    -I2CBASE   
T_I2CCFG                       EQU       I2CCFG    -I2CBASE   
T_I2CDIV                       EQU       I2CDIV    -I2CBASE   
T_I2CID0                       EQU       I2CID0    -I2CBASE   
T_I2CID1                       EQU       I2CID1    -I2CBASE   
T_I2CID2                       EQU       I2CID2    -I2CBASE   
T_I2CID3                       EQU       I2CID3    -I2CBASE   
T_I2CCCNT                      EQU       I2CCCNT   -I2CBASE   
T_I2CFSTA                      EQU       I2CFSTA   -I2CBASE   

I2CMSTA_OFFSET                 EQU       0x0800
I2CSSTA_OFFSET                 EQU       0x0804
I2CSRX_OFFSET                  EQU       0x0808
I2CSTX_OFFSET                  EQU       0x080C
I2CMRX_OFFSET                  EQU       0x0810
I2CMTX_OFFSET                  EQU       0x0814
I2CCNT_OFFSET                  EQU       0x0818
I2CADR_OFFSET                  EQU       0x081C
I2CBYTE_OFFSET                 EQU       0x0824
I2CALT_OFFSET                  EQU       0x0828
I2CCFG_OFFSET                  EQU       0x082C
I2CDIV_OFFSET                  EQU       0x0830
I2CID0_OFFSET                  EQU       0x0838
I2CID1_OFFSET                  EQU       0x083C
I2CID2_OFFSET                  EQU       0x0840
I2CID3_OFFSET                  EQU       0x0844
I2CCCNT_OFFSET                 EQU       0x0848
I2CFSTA_OFFSET                 EQU       0x084C

; I2C BUS PERIPHERAL DEVICE 0

I2C0BASE                       EQU       0xFFFF0800
I2C0MSTA                       EQU       0xFFFF0800
I2C0SSTA                       EQU       0xFFFF0804
I2C0SRX                        EQU       0xFFFF0808
I2C0STX                        EQU       0xFFFF080C
I2C0MRX                        EQU       0xFFFF0810
I2C0MTX                        EQU       0xFFFF0814
I2C0CNT                        EQU       0xFFFF0818
I2C0ADR                        EQU       0xFFFF081C
I2C0BYTE                       EQU       0xFFFF0824
I2C0ALT                        EQU       0xFFFF0828
I2C0CFG                        EQU       0xFFFF082C
I2C0DIV                        EQU       0xFFFF0830
I2C0ID0                        EQU       0xFFFF0838
I2C0ID1                        EQU       0xFFFF083C
I2C0ID2                        EQU       0xFFFF0840
I2C0ID3                        EQU       0xFFFF0844
I2C0CCNT                       EQU       0xFFFF0848
I2C0FSTA                       EQU       0xFFFF084C
Z_I2C0MSTA                     EQU       I2C0MSTA  -Z_BASE
Z_I2C0SSTA                     EQU       I2C0SSTA  -Z_BASE
Z_I2C0SRX                      EQU       I2C0SRX   -Z_BASE
Z_I2C0STX                      EQU       I2C0STX   -Z_BASE
Z_I2C0MRX                      EQU       I2C0MRX   -Z_BASE
Z_I2C0MTX                      EQU       I2C0MTX   -Z_BASE
Z_I2C0CNT                      EQU       I2C0CNT   -Z_BASE
Z_I2C0ADR                      EQU       I2C0ADR   -Z_BASE
Z_I2C0BYTE                     EQU       I2C0BYTE  -Z_BASE
Z_I2C0ALT                      EQU       I2C0ALT   -Z_BASE
Z_I2C0CFG                      EQU       I2C0CFG   -Z_BASE
Z_I2C0DIV                      EQU       I2C0DIV   -Z_BASE
Z_I2C0ID0                      EQU       I2C0ID0   -Z_BASE
Z_I2C0ID1                      EQU       I2C0ID1   -Z_BASE
Z_I2C0ID2                      EQU       I2C0ID2   -Z_BASE
Z_I2C0ID3                      EQU       I2C0ID3   -Z_BASE
Z_I2C0CCNT                     EQU       I2C0CCNT  -Z_BASE
Z_I2C0FSTA                     EQU       I2C0FSTA  -Z_BASE

T_I2C0MSTA                     EQU       I2C0MSTA  -I2C0BASE  
T_I2C0SSTA                     EQU       I2C0SSTA  -I2C0BASE  
T_I2C0SRX                      EQU       I2C0SRX   -I2C0BASE  
T_I2C0STX                      EQU       I2C0STX   -I2C0BASE  
T_I2C0MRX                      EQU       I2C0MRX   -I2C0BASE  
T_I2C0MTX                      EQU       I2C0MTX   -I2C0BASE  
T_I2C0CNT                      EQU       I2C0CNT   -I2C0BASE  
T_I2C0ADR                      EQU       I2C0ADR   -I2C0BASE  
T_I2C0BYTE                     EQU       I2C0BYTE  -I2C0BASE  
T_I2C0ALT                      EQU       I2C0ALT   -I2C0BASE  
T_I2C0CFG                      EQU       I2C0CFG   -I2C0BASE  
T_I2C0DIV                      EQU       I2C0DIV   -I2C0BASE  
T_I2C0ID0                      EQU       I2C0ID0   -I2C0BASE  
T_I2C0ID1                      EQU       I2C0ID1   -I2C0BASE  
T_I2C0ID2                      EQU       I2C0ID2   -I2C0BASE  
T_I2C0ID3                      EQU       I2C0ID3   -I2C0BASE  
T_I2C0CCNT                     EQU       I2C0CCNT  -I2C0BASE  
T_I2C0FSTA                     EQU       I2C0FSTA  -I2C0BASE  

I2C0MSTA_OFFSET                EQU       0x0800
I2C0SSTA_OFFSET                EQU       0x0804
I2C0SRX_OFFSET                 EQU       0x0808
I2C0STX_OFFSET                 EQU       0x080C
I2C0MRX_OFFSET                 EQU       0x0810
I2C0MTX_OFFSET                 EQU       0x0814
I2C0CNT_OFFSET                 EQU       0x0818
I2C0ADR_OFFSET                 EQU       0x081C
I2C0BYTE_OFFSET                EQU       0x0824
I2C0ALT_OFFSET                 EQU       0x0828
I2C0CFG_OFFSET                 EQU       0x082C
I2C0DIV_OFFSET                 EQU       0x0830
I2C0ID0_OFFSET                 EQU       0x0838
I2C0ID1_OFFSET                 EQU       0x083C
I2C0ID2_OFFSET                 EQU       0x0840
I2C0ID3_OFFSET                 EQU       0x0844
I2C0CCNT_OFFSET                EQU       0x0848
I2C0FSTA_OFFSET                EQU       0x084C

